sourcecode/app/controllers/connections_controller.rb

INSERT INTO "connections" ("created_at", "updated_at", "follower_id", "followee_id") VALUES (?, ?, ?, ?)  [["created_at", 2017-03-19 20:05:25 UTC], ["updated_at", 2017-03-19 20:05:25 UTC], ["follower_id", 1], ["followee_id", 1]]
---
  def create
    Connection.create(follower_id: current_user.id, followee_id: params[:connection][:followee_id])

SELECT "connections".* FROM "connections" WHERE "connections"."followee_id" = 1 AND "connections"."confirmed" = ?  [["confirmed", false]]
SELECT  1 AS one FROM "users" INNER JOIN "connections" ON "users"."id" = "connections"."followee_id" WHERE "connections"."follower_id" = ? AND "users"."id" = ? LIMIT ?  [["follower_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    @pending = Connection.where(followee_id: current_user, confirmed: false)

    # exclude self and pending
    # sending fr request does not make sense
    blacklisted_ids = [current_user.id]
    @pending.each do |p|
      blacklisted_ids.push(p.follower_id)
    end

    @people = User.all.reject { |u| blacklisted_ids.include?(u.id) }

SELECT  "connections".* FROM "connections" WHERE "connections"."follower_id" = ? AND "connections"."followee_id" = ? ORDER BY "connections"."id" ASC LIMIT ?  [["follower_id", 3], ["followee_id", 1], ["LIMIT", 1]]
---
  def confirm
    follower_id = params[:connections_confirm][:id].to_i
    c = Connection.where(follower_id: follower_id, followee_id: current_user.id).first