sourcecode/app/controllers/conversations_controller.rb

  def show
    @conversation = current_user.mailbox.conversations.find(params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    connection = Connection.find(params[:connection])
    recipient = nil
    if current_user.id == connection.followee_id
      recipient = User.find(connection.follower_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]