sourcecode/app/controllers/conversations_controller.rb

  def show
    @connection = Connection.where(channel: params[:channel]).first
---
SELECT  "connections".* FROM "connections" WHERE "connections"."channel" = ? ORDER BY "connections"."id" ASC LIMIT ?  [["channel", "CH54f89806e41d4eb8bc68e52b0d76ee2d"], ["LIMIT", 1]]

  def new
    connection = Connection.find(params[:connection])
    ip_messaging_client = Twilio::REST::IpMessagingClient.new(ENV['API_KEY_SID'], ENV['API_KEY_SECRET'])

    # Create the channel
    service = ip_messaging_client.services.get(ENV['IPM_SERVICE_SID'])

    channel = service.channels.create()

    connection.channel = channel.sid
    connection.save()
---
SELECT  "connections".* FROM "connections" WHERE "connections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "connections" SET "channel" = ?, "updated_at" = ? WHERE "connections"."id" = ?  [["channel", "CHecc8a2257d104181983e98d611d4fb3d"], ["updated_at", 2017-03-26 16:22:19 UTC], ["id", 1]]

  def update_last_read
    params.permit(:channel, :message_sid)
    sid = params[:channel]
    msid = params[:message_sid]

    raise "Value error" if not sid
    raise "Value error " if not msid

    c = Connection.where(channel: sid).first
    raise "Unable to find entity" if not c

    cuser = current_user
    if c.follower_id == current_user.id
      c.follower_lastread_sid = msid
      c.follower_lastread_ts = Time.now.utc.iso8601
    else
      c.followee_lastread_sid = msid
      c.followee_lastread_ts = Time.now.utc.iso8601
    end
    c.save()
---
SELECT  "connections".* FROM "connections" WHERE "connections"."channel" = ? ORDER BY "connections"."id" ASC LIMIT ?  [["channel", "CH54f89806e41d4eb8bc68e52b0d76ee2d"], ["LIMIT", 1]]
UPDATE "connections" SET "followee_lastread_sid" = ?, "followee_lastread_ts" = ?, "updated_at" = ? WHERE "connections"."id" = ?  [["followee_lastread_sid", "IM1566f45cde464826a7579cecc48a76af"], ["followee_lastread_ts", 2017-03-27 08:27:51 UTC], ["updated_at", 2017-03-27 08:27:51 UTC], ["id", 3]]