sourcecode/app/views/conversations/show.html.erb

SELECT  "messages".* FROM "messages" WHERE (conversation_id=17 AND user_id = 1 OR user_id = NULL) ORDER BY created_at ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
            // Join the general channel
            generalChannel.join().then(function(channel) {
                channel.getMessages(1).then(function(messages) {
                    //determine the newest message index

                    var totalMessages = messages.items.length;
                    for (i=0; i<totalMessages; i++) {
                        var message = messages.items[i];
                        insert_message(messages, $chatWindow);
                    }
                    last_message_sid = messages.items[messages.items.length - 1].sid;
                    session_messages = messages.items;
                    update_read_line(messages, generalChannel, session_messages);

                });
            });