app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @people = User.all